/* Задание: 
Вы должны создать function vowels() {} которая будет принимать параметр. 
Принимаемый параметр является строкой, стихом или словом. ("Я помню чудное мгновенье").
Ваша задача подсчитать сколько гласных букв в этом параметре и отдать количество и строку в “console”. */


function vowels() {
    let str = prompt('Введите какое либо предложение', "Я помню чудное мгновенье");
    let words = ["a","A","u","U","e","E","i","I","o","O","у","У","е","Е","ы","Ы","а","А","о","О","э","Э","я","Я","и","И","ю","Ю","ё","Ё"]
    let a = 0;
    for (const key in str) {
        for (const keys in words) {
            if (str[key] == words[keys]) {
                a += 1;
            }
        }  
    }
    console.log(str);
    console.log(a);
}
vowels()

